#include <config.h>
/**
  ******************************************************************************
  * 文件名称：random
  * 作者：无木成林
  * 版本: V1.0
  * 编写日期: 2017/3/28
  * 功能: 伪随机数发生器
  ******************************************************************************
  * 说明:
  * 生成随机数
  ******************************************************************************
**/
static unsigned long Seed = 1;
#define A 48271L
#define M 2147483647L
#define Q (M / A)
#define R (M % A)

/************************************
伪随机数发生器
*************************************/
double Random(void)
{
	long TmpSeed;
	TmpSeed=A*(Seed%Q)-R*(Seed/Q);
	if(TmpSeed>=0)
		Seed=TmpSeed;
	else
		Seed=TmpSeed+M;
	return (double)Seed/M;
}
/**************************************
为随机数播种
***************************************/
void InitRandom(unsigned long InitVal)
{
	Seed=InitVal;
}